Masmiseim36/nxpSDK/boards/evkmimxrt595/dsp_examples/xaf_playback/fusionf1/pin_mux.h
/*
 * Copyright 2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */


/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FULLDRIVE_EN 0x0100u   /*!<@brief Full drive enable */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_FUNC4 0x04u            /*!<@brief Selects pin function 4 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name FC4_TXD_SCL_MISO_WS (coord B11), UART_TX
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_UART_TX_PERIPHERAL FLEXCOMM4               /*!<@brief Peripheral name */
#define BOARD_INITPINS_UART_TX_SIGNAL TXD_SCL_MISO_WS             /*!<@brief Signal name */
                                                                  /* @} */

/*! @name FC4_RXD_SDA_MOSI_DATA (coord D14), UART_RX
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_UART_RX_PERIPHERAL FLEXCOMM4              /*!<@brief Peripheral name */
#define BOARD_INITPINS_UART_RX_SIGNAL RXD_SDA_MOSI_DATA          /*!<@brief Signal name */
                                                                 /* @} */

/*! @name FC1_SCK (coord J15), I2S_CLK
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_I2S_CLK_PERIPHERAL FLEXCOMM1              /*!<@brief Peripheral name */
#define BOARD_INITPINS_I2S_CLK_SIGNAL SCK                        /*!<@brief Signal name */
                                                                 /* @} */

/*! @name FC1_TXD_SCL_MISO_WS (coord H12), I2S_TX
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_I2S_TX_PERIPHERAL FLEXCOMM1               /*!<@brief Peripheral name */
#define BOARD_INITPINS_I2S_TX_SIGNAL TXD_SCL_MISO_WS             /*!<@brief Signal name */
                                                                 /* @} */

/*! @name FC1_RXD_SDA_MOSI_DATA (coord H17), I2S_RX
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_I2S_RX_PERIPHERAL FLEXCOMM1              /*!<@brief Peripheral name */
#define BOARD_INITPINS_I2S_RX_SIGNAL RXD_SDA_MOSI_DATA          /*!<@brief Signal name */
                                                                /* @} */

/*! @name FC3_RXD_SDA_MOSI_DATA (coord C13), I2S3
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_I2S3_PERIPHERAL FLEXCOMM3              /*!<@brief Peripheral name */
#define BOARD_INITPINS_I2S3_SIGNAL RXD_SDA_MOSI_DATA          /*!<@brief Signal name */
                                                              /* @} */

/*! @name PDM_CLK01 (coord P2), DMIC_CLK
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_DMIC_CLK_PERIPHERAL DMIC0   /*!<@brief Peripheral name */
#define BOARD_INITPINS_DMIC_CLK_SIGNAL CLK         /*!<@brief Signal name */
#define BOARD_INITPINS_DMIC_CLK_CHANNEL 01         /*!<@brief Signal channel */
                                                   /* @} */

/*! @name PDM_DATA01 (coord P3), DMIC_DATA01
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_DMIC_DATA01_PERIPHERAL DMIC0    /*!<@brief Peripheral name */
#define BOARD_INITPINS_DMIC_DATA01_SIGNAL DATA         /*!<@brief Signal name */
#define BOARD_INITPINS_DMIC_DATA01_CHANNEL 01          /*!<@brief Signal channel */
                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
